
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр СпросКартриджей
	Движения.СпросКартриджей.Записывать = Истина;
	
	Для Каждого ТекСтрокаКартриджи Из Картриджи Цикл
		
		Движение = Движения.СпросКартриджей.Добавить();
		
		Движение.Период              = Дата;
		Движение.МодельКартриджа     = ТекСтрокаКартриджи.МодельКартриджа;
		Движение.Подразделение       = Подазделение;
		Движение.Количество          = ТекСтрокаКартриджи.Количество;
		Движение.КоличествоИсполнено = ТекСтрокаКартриджи.Исполнено;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ПроверкаИсполненияДокумента();
	
КонецПроцедуры

//Процедура проверяет количество отгруженных и количество требуемых картриджей и ставит статус исполнения документа.
Процедура ПроверкаИсполненияДокумента()
	
	НеВыполнено = 0;
	ВыполненоЧастично = 0;
	Выполнено = 0;	
	КоличествоСтрокКартриджей = Картриджи.Количество();
	
	Для Каждого Строка Из Картриджи Цикл
		
		Если Строка.Исполнено = 0 Тогда			
			НеВыполнено = НеВыполнено + 1;						
		ИначеЕсли Строка.Исполнено < Строка.Количество Тогда
			ВыполненоЧастично = ВыполненоЧастично + 1;			
		ИначеЕсли Строка.Исполнено = Строка.Количество Или Строка.Исполнено > Строка.Количество Тогда
			Выполнено = Выполнено + 1;			
		КонецЕсли;
				
	КонецЦикла;
	
	Если ВыполненоЧастично > 0 Тогда
		Исполнен = Перечисления.ИсполнениеСпросов.ВыполненоЧастично;
	ИначеЕсли НеВыполнено = КоличествоСтрокКартриджей Тогда
		Исполнен = Перечисления.ИсполнениеСпросов.НеВыполнено;
	ИначеЕсли Выполнено = КоличествоСтрокКартриджей Тогда
		Исполнен = Перечисления.ИсполнениеСпросов.Выполнено;
	КонецЕсли;
		
КонецПроцедуры

