
&НаКлиенте
Процедура КартриджиКартриджиПриИзменении(Элемент)
	
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Производитель = ПолучитьПроизводителя(Стр.Картриджи);
	Стр.Количество = 1;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроизводителя(Картридж)
	
	Возврат Картридж.Производитель;	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Дата = НачалоДня(ТекущаяДата()) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Подразделение = Справочники.Подразделения;
	Если Объект.Подразделение = Подразделение.ПустаяСсылка() тогда
		Объект.Подразделение = ПараметрыСеанса.ТекущийПользователь.ОсновноеПодразделение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	Если Объект.Подразделение <> ПредопределенноеЗначение("Справочник.Подразделения.ПустаяСсылка") Тогда
		
		СтруктураПараметры = Новый Структура;
		СтруктураПараметры.Вставить("ИмяДокумента", "ПоступлениеКартриджей");
		
		Форма = ПолучитьФорму("ОбщаяФорма.ФормаПодбора", СтруктураПараметры, ЭтаФорма);
		Форма.Открыть();
		
	Иначе
		Сообщить("Выберите подразделение!");
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	//ПредварительнаяЗапись();
	ПроверкаНаОдинаковыеСтроки();
	
КонецПроцедуры

&НаСервере
Процедура ПредварительнаяЗапись()
	Объект.Ссылка.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Запись);
КонецПроцедуры // ПредварительнаяЗапись();()

&НаСервере
Процедура ПроверкаНаОдинаковыеСтроки()
	
	ТЗ_Картриджи = Объект.Картриджи.Выгрузить();
	
	ТЗ_Картриджи.Свернуть("Картриджи, Производитель", "Количество");
	
	Объект.Картриджи.Очистить();
	Объект.Картриджи.Загрузить(ТЗ_Картриджи);
	
КонецПроцедуры // ПРоВеркаНаОдинаковыесТРОКИ()

&НаКлиенте
Процедура ПриЗакрытии()
	ОбновитьИнтерфейс();
КонецПроцедуры

