
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПоСтелажу();
	//НАЗаправке();
	
КонецПроцедуры

&НаСервере
Процедура ПоСтелажу()
  	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиКартриджейОстатки.Картридж,
		|	ОстаткиКартриджейОстатки.Подразделения,
		|	ОстаткиКартриджейОстатки.КоличествоОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиКартриджей.Остатки КАК ОстаткиКартриджейОстатки
		|ГДЕ
		|	ОстаткиКартриджейОстатки.КоличествоОстаток > 0
		|	И ОстаткиКартриджейОстатки.Подразделения.Склад = ИСТИНА";

	Результат = Запрос.Выполнить();

    НаСтелаже1.Очистить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = НаСтелаже1.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура НАЗаправке()
	
  	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиКартриджейОстатки.Картридж,
		|	ОстаткиКартриджейОстатки.Подразделения,
		|	ОстаткиКартриджейОстатки.КоличествоОстаток КАК Остаток
		|ИЗ
		|	РегистрНакопления.ОстаткиКартриджей.Остатки КАК ОстаткиКартриджейОстатки
		|ГДЕ
		|	ОстаткиКартриджейОстатки.Подразделения.ВидПодразделения = ЗНАЧЕНИЕ(Перечисление.ВидыПодразделений.ЗаправляющаяОрганизация)
		|	И ОстаткиКартриджейОстатки.КоличествоОстаток > 0";

	Результат = Запрос.Выполнить();
   	НаЗаправке1.Очистить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = НаЗаправке1.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи);
		
	КонецЦикла;

КонецПроцедуры
