
Процедура Печать(ТабДок, Ссылка) Экспорт
		
	Макет = Документы.ПриемПередачаКартриджей.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриемПередачаКартриджей.Автор,
	|	ПриемПередачаКартриджей.Дата,
	|	ПриемПередачаКартриджей.Номер,
	|	ПриемПередачаКартриджей.ОснПодразделение,
	|	ПриемПередачаКартриджей.ПользовПодразделение,
	|	ПриемПередачаКартриджей.Передача.(
	|		НомерСтроки,
	|		Картридж,
	|		ИнвНомер,
	|		Статус
	|	),
	|	ПриемПередачаКартриджей.ПользовПодразделение.Принтер КАК Принтер,
	|	ПриемПередачаКартриджей.ПользовПодразделение.Принтер.Производитель КАК МодельПринтера
	|ИЗ
	|	Документ.ПриемПередачаКартриджей КАК ПриемПередачаКартриджей
	|ГДЕ
	|	ПриемПередачаКартриджей.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьПередачаШапка = Макет.ПолучитьОбласть("ПередачаШапка");
	ОбластьПередача = Макет.ПолучитьОбласть("Передача");
	Подвал = Макет.ПолучитьОбласть("Подвал");
    	

	ВставлятьРазделительСтраниц = Ложь;
	
	Для РАЗ = 1 ПО 2 ЦИКЛ	
		Выборка = Запрос.Выполнить().Выбрать();

		СтрокаПринтеры = "";
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());			
			
			ТабДок.Вывести(ОбластьПередачаШапка);
			ВыборкаПередача = Выборка.Передача.Выбрать();
					
			Пока ВыборкаПередача.Следующий() Цикл
				
				ОбластьПередача.Параметры.Заполнить(ВыборкаПередача);
				ТабДок.Вывести(ОбластьПередача, ВыборкаПередача.Уровень());
				
				Если ЗначениеЗаполнено(Выборка.ПользовПодразделение)
					И Не Выборка.ПользовПодразделение.ВидПодразделения = Перечисления.ВидыПодразделений.ЗаправляющаяОрганизация Тогда
					
					Картридж = ВыборкаПередача.Картридж;
					Если ЗначениеЗаполнено(Картридж) Тогда  				
						Модель = Картридж.Модель;
						Если ЗначениеЗаполнено(Модель) Тогда						
							Для каждого СтрокаПринтер Из Модель.Принтера Цикл
								СтрокаПринтеры = СтрокаПринтеры + ?(ЗначениеЗаполнено(СтрокаПринтеры),", ","")+ Строка(СтрокаПринтер.Принтер.Производитель)+" " +Строка(СтрокаПринтер.Принтер);				
							КонецЦикла; 				    					
						КонецЕсли;                          			
					КонецЕсли; 				
				
				КонецЕсли; 			 
				
			КонецЦикла;   		
			
			Подвал.Параметры.Заполнить(Выборка);
			
			Если ЗначениеЗаполнено(СтрокаПринтеры) Тогда
				Подвал.Параметры.МодельПринтера = "";
				Подвал.Параметры.Принтер        = СокрЛП(СтрокаПринтеры);
			Иначе	
				Подвал.Параметры.МодельПринтера = СокрЛП(Выборка.МодельПринтера);	
			КонецЕсли;                                                   		
			
			ТабДок.Вывести(Подвал);
			
		КонецЦикла;
					
	КонецЦикла;	
	
	
КонецПроцедуры
