
&НаСервере
Процедура УстановитьПринтер()

	Объект.Принтер = Неопределено;
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Объект.Принтер = Объект.Владелец.Принтер;	
	КонецЕсли;                                   	

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьВидимость()

	Если Объект.Ссылка.Пустая() Тогда
		Элементы.СтраницаФайлы.Доступность = Ложь;	
	Иначе	
		Элементы.СтраницаФайлы.Доступность = Истина;	
	КонецЕсли; 

	СписокФайлов.Параметры.УстановитьЗначениеПараметра("Объект",Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.ДатаРемонта = ТекущаяДата();
		
		Если ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
			ЗначенияЗаполнения = Параметры.ЗначенияЗаполнения;
			Если ЗначенияЗаполнения.Свойство("Владелец") Тогда		
				Если ЗначениеЗаполнено(ЗначенияЗаполнения.Владелец) Тогда
					Объект.Принтер = ЗначенияЗаполнения.Владелец.Принтер;		
				КонецЕсли;                                               			
			КонецЕсли;                                        
		КонецЕсли;
		
	КонецЕсли;    
	
КонецПроцедуры
        
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	УстановитьВидимость();
	
КонецПроцедуры  

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Наименование = Строка(Объект.Владелец) + " " +Строка(Объект.ДатаРемонта);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокФайловПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ОбъектХранилища",Объект.Ссылка);
	ЗначенияЗаполнения.Вставить("ВидДанных"      ,ПредопределенноеЗначение("Перечисление.ВидыДополнительнойИнформацииОбъектов.Файл"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения",ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.Файлы.Форма.ФормаЭлемента", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	
	ТекущиеДанные = Элементы.СписокФайлов.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	РаботаСФайламиКлиент.ОткрытьФайлы(ТекущиеДанные.ИмяФайла, ТекущиеДанные.Ссылка, Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	УстановитьПринтер();
	
КонецПроцедуры





