
&НаСервереБезКонтекста
Функция ПолучитьПроизводителя(Картридж)
	
	Возврат Картридж.Модель.Производитель;	
	
КонецФункции // ПолучитьПроизводителя()

&НаКлиенте
Процедура КартриджиКартриджиПриИзменении(Элемент)
	
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Производитель = ПолучитьПроизводителя(Стр.Картриджи);
	//Стр.Количество = 1;
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	П = Новый Структура("Праметр",Объект);
	Форма = ПолучитьФорму("ОбщаяФорма.ФормаПодбора", П, ЭтаФорма);
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
		
	 ПроверкаНаОдинаковыеСтроки();
	
КонецПроцедуры
 
 &НаСервере
Процедура ПроверкаНаОдинаковыеСтроки()
	
	ТЗ_Картриджи = Объект.Картриджи.Выгрузить();
	
	ТЗ_Картриджи.Свернуть("Картриджи, Производитель, Комментарий", "Количество");
	
	Объект.Картриджи.Очистить();
	Объект.Картриджи.Загрузить(ТЗ_Картриджи); 	
		
КонецПроцедуры // ПРоВеркаНаОдинаковыесТРОКИ()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Дата = НачалоДня(ТекущаяДата()) ТОгда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;	
	
КонецПроцедуры
