
&НаКлиенте
Процедура КартриджиМодельКартриджаПриИзменении(Элемент)
	
	Стр = ТекущийЭлемент.ТекущиеДанные;
	Стр.Производитель = ПолучитьПроизводителя(Стр.МодельКартриджа);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПроизводителя(МодельКартриджа)

	Возврат МодельКартриджа.Производитель;

КонецФункции // ПолучитьПроизводителя()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Выставляем дату
	Если Объект.Дата = НачалоДня(ТекущаяДата()) ТОгда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	//Ставим статус документа
	Если Объект.Исполнен = ПредопределенноеЗначение("Перечисление.ИсполнениеСпросов.ПустаяСсылка") Тогда
		Объект.Исполнен = ПредопределенноеЗначение("Перечисление.ИсполнениеСпросов.НеВыполнено");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбновитьИнтерфейс();
КонецПроцедуры
