
&НаСервере
Процедура УстановитьОсновноеИзображение(ОсновноеИзображение,СсылкаНаОбъект)
	
	СпрвочникОбъект = СсылкаНаОбъект.ПолучитьОбъект();
	Если ЗначениеЗаполнено(ОсновноеИзображение.ИмяФайла) Тогда
		СпрвочникОбъект.ОсновноеИзображение = ОсновноеИзображение;
	Иначе	
		СпрвочникОбъект.ОсновноеИзображение = Неопределено;	
	КонецЕсли;
	СпрвочникОбъект.Записать();
	
	ЗначениеВРеквизитФормы(СпрвочникОбъект, "Объект");

КонецПроцедуры // УстановитьКартинку() 

&НаСервере
Процедура УстановитьКартинку(ОсновноеИзображение)
	
	Если ЗначениеЗаполнено(ОсновноеИзображение.ИмяФайла) Тогда
		КартинкаАдрес = ПолучитьНавигационнуюСсылку(ОсновноеИзображение,"Хранилище");
	Иначе	
		КартинкаАдрес = "";	
	КонецЕсли; 
	
	Элементы.Картинка.РазмерКартинки = РазмерКартинки.АвтоРазмер;

КонецПроцедуры // УстановитьКартинку() 

&НаСервере
Процедура ВывестиСписокПринтеров()
	
	Запрос=Новый Запрос(
	"ВЫБРАТЬ
	|	МоделиКартриджейПринтера.Ссылка
	|ИЗ
	|	Справочник.МоделиКартриджей.Принтера КАК МоделиКартриджейПринтера
	|ГДЕ
	|	МоделиКартриджейПринтера.Принтер = &Принтер");
	Запрос.УстановитьПараметр("Принтер",ЭтаФорма.Объект.Ссылка);
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Сообщить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры
     
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВывестиСписокПринтеров();
	
	УстановитьКартинку(Объект.ОсновноеИзображение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьОсновноеИзображение" Тогда
		
		Если ТипЗнч(Параметр) = Тип("Структура") Тогда
			
			Если Параметр.Свойство("ОбъектХранилища") Тогда
				
				Если Параметр.ОбъектХранилища = Объект.Ссылка Тогда
					
					УстановитьОсновноеИзображение(Параметр.ОсновноеИзображение, Объект.Ссылка);	
									
					УстановитьКартинку(Параметр.ОсновноеИзображение);
				
				КонецЕсли;                                         			
			
			КонецЕсли;                                             		
		
		КонецЕсли;                              	
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Изображения(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ТекстВопроса = "Для выполнения данной операции необходимо записать элемент. Записать?";		
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда			
			Попытка
				Записать();
			Исключение
				Сообщить(ОписаниеОшибки());
				Возврат;
			КонецПопытки;
		КонецЕсли;
	
	КонецЕсли;    
	
	Отбор = Новый Структура;
	Отбор.Вставить("ОбъектХранилища",Объект.Ссылка);
	Отбор.Вставить("ВидДанных"      ,ПредопределенноеЗначение("Перечисление.ВидыДополнительнойИнформацииОбъектов.Изображение"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор"              ,Отбор);  	
	ПараметрыФормы.Вставить("ОсновноеИзображение",Объект.ОсновноеИзображение);
	ПараметрыФормы.Вставить("ОбъектХранилища"    ,Объект.Ссылка);
			
	ОткрытьФорму("Справочник.Файлы.Форма.ФормаСпискаИзображений",ПараметрыФормы,ЭтаФорма,УникальныйИдентификатор,ВариантОткрытияОкна.ОтдельноеОкно); 	
	
КонецПроцедуры
       

