
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиКартриджей Приход
	Движения.ОстаткиКартриджей.Записывать = Истина;
	Для Каждого ТекСтрокаКартриджи Из Картриджи Цикл
		Движение = Движения.ОстаткиКартриджей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Картридж = ТекСтрокаКартриджи.Картриджи;
		Движение.Подразделения = Подразделение;
		Движение.Количество = ТекСтрокаКартриджи.Количество;
	КонецЦикла;

	// регистр ПоступлениеКартриджей
	Движения.ПоступлениеКартриджей.Записывать = Истина;
	Для Каждого ТекСтрокаКартриджи Из Картриджи Цикл
		Движение = Движения.ПоступлениеКартриджей.Добавить();
		Движение.Период = Дата;
		Движение.ПодразделениеИсточник = ПодразделениеИсточник;
		Движение.Картриджи = ТекСтрокаКартриджи.Картриджи;
		Движение.Количество = ТекСтрокаКартриджи.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
